Revit 2027 API
ComboBox.CurrentChanged Event
Subscribe to this event to be notified when the current item of the ComboBox is changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ComboBoxCurrentChangedEventArgs> CurrentChanged
Public Event CurrentChanged As EventHandler(Of ComboBoxCurrentChangedEventArgs)
public:
 event EventHandler<ComboBoxCurrentChangedEventArgs^>^ CurrentChanged {
	void add (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
	void remove (EventHandler<ComboBoxCurrentChangedEventArgs^>^ value);
}
member CurrentChanged : IEvent<EventHandler<ComboBoxCurrentChangedEventArgs>,
    ComboBoxCurrentChangedEventArgs>
Value
EventHandler<ComboBoxCurrentChangedEventArgs>
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace